tylertms/dspic33e-sim/src/firmware_runner.c
#include "firmware_runner.h"

#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#ifdef _WIN32
#include <windows.h>
#endif

#include "dspic33.h"
#include "firmware_image.h"
#include "json.h"
#include "scenario_stream.h"

enum { MAX_STEP_PARTS = 32, MAX_MATRIX_DIMENSIONS = 16 };

typedef struct RunTask RunTask;

typedef struct {
    const JsonValue* suite;
    const char* suite_path;
    char suite_directory[1024];
    const char* scenario_filter;
    const char* step_filter;
    bool failures_only;
    size_t scenarios;
    size_t steps;
    size_t current_scenario;
    size_t current_step;
    size_t passed;
    size_t failed;
    size_t comparisons;
    uint64_t reference_instructions;
    uint64_t candidate_instructions;
    uint64_t reference_cycles;
    uint64_t candidate_cycles;
    uint64_t instruction_limit;
    FirmwareImage reference_image;
    FirmwareImage candidate_image;
    Dspic33 reference;
    Dspic33 candidate;
#ifdef _WIN32
    RunTask* run_tasks;
#endif
} Runner;

typedef struct {
    const JsonValue* items[MAX_STEP_PARTS];
    size_t count;
} StepParts;

typedef struct {
    const JsonValue* specification;
    const JsonValue* explicit_case;
    int64_t value;
    bool generated;
} MatrixSelection;

static bool parse_number(const JsonValue* value, int64_t* result) {
    const char* string;
    char* end;
    long long parsed;
    if (json_integer(value, result)) {
        return true;
    }
    string = json_string(value);
    if (string == NULL) {
        return false;
    }
    parsed = strtoll(string, &end, 0);
    if (*string == '\0' || *end != '\0') {
        return false;
    }
    *result = (int64_t)parsed;
    return true;
}

static bool parse_hex_bytes(const char* text, uint8_t* bytes, size_t size) {
    size_t index;
    if (text == NULL) {
        return false;
    }
    for (index = 0u; index < size; index++) {
        char* end;
        unsigned long value;
        while (*text == ' ' || *text == '\t') {
            text++;
        }
        if (*text == '\0') {
            return false;
        }
        value = strtoul(text, &end, 16);
        if (end == text || value > UINT8_MAX ||
            (*end != '\0' && *end != ' ' && *end != '\t')) {
            return false;
        }
        bytes[index] = (uint8_t)value;
        text = end;
    }
    while (*text == ' ' || *text == '\t') {
        text++;
    }
    return *text == '\0';
}

static bool wildcard_matches(const char* pattern, const char* value) {
    const char* star = NULL;
    const char* retry = NULL;
    while (*value != '\0') {
        if (*pattern == '?' || *pattern == *value) {
            pattern++;
            value++;
        } else if (*pattern == '*') {
            star = pattern++;
            retry = value;
        } else if (star != NULL) {
            pattern = star + 1;
            value = ++retry;
        } else {
            return false;
        }
    }
    while (*pattern == '*') {
        pattern++;
    }
    return *pattern == '\0';
}

static bool scenario_selected(const Runner* runner, const JsonValue* scenario) {
    const char* id = json_string(json_get(scenario, "id"));
    const char* name = json_string(json_get(scenario, "name"));
    return runner->scenario_filter == NULL ||
           (id != NULL && wildcard_matches(runner->scenario_filter, id)) ||
           (name != NULL && wildcard_matches(runner->scenario_filter, name));
}

static bool step_selected(const Runner* runner, const JsonValue* step) {
    const char* id = json_string(json_get(step, "id"));
    const char* name = json_string(json_get(step, "name"));
    return runner->step_filter == NULL ||
           (id != NULL && wildcard_matches(runner->step_filter, id)) ||
           (name != NULL && wildcard_matches(runner->step_filter, name));
}

static bool generated_step_selected(const Runner* runner, const char* name) {
    return runner->step_filter == NULL || wildcard_matches(runner->step_filter, name);
}

static size_t generated_step_count(const Runner* runner, const char* scenario_name,
                                   const char* kind, size_t count) {
    size_t selected = 0u;
    size_t index;
    char name[512];
    if (runner->step_filter == NULL) {
        return count;
    }
    for (index = 0u; index < count; index++) {
        snprintf(name, sizeof(name), "%s %s %zu", scenario_name, kind, index + 1u);
        if (generated_step_selected(runner, name)) {
            selected++;
        }
    }
    return selected;
}

static const JsonValue* named_entry(const JsonValue* object, const char* name) {
    return json_get(object, name);
}

static const JsonValue* suite_section(const Runner* runner, const char* name) {
    return json_get(runner->suite, name);
}

static const JsonValue* location_entry(const Runner* runner,
                                       const JsonValue* specification) {
    const char* name;
    const JsonValue* location;
    if (specification == NULL) {
        return NULL;
    }
    if (specification->type == JSON_STRING) {
        name = json_string(specification);
    } else {
        location = json_get(specification, "location");
        name = json_string(location);
        if (name == NULL) {
            return specification;
        }
    }
    return named_entry(suite_section(runner, "locations"), name);
}

static const JsonValue* entry_field(const Runner* runner,
                                    const JsonValue* specification, const char* name) {
    const JsonValue* value = json_get(specification, name);
    const JsonValue* location;
    if (value != NULL) {
        return value;
    }
    location = location_entry(runner, specification);
    return location == specification ? NULL : json_get(location, name);
}

static bool mapped_address(const Runner* runner, const JsonValue* specification,
                           bool candidate, uint32_t* result, char* error,
                           size_t error_size) {
    const JsonValue* value;
    const char* symbol;
    int64_t address;
    int64_t common_offset = 0;
    int64_t image_offset = 0;
    if (candidate) {
        value = entry_field(runner, specification, "candidate_symbol");
        symbol = json_string(value);
        if (symbol != NULL) {
            if (!firmware_image_symbol(&runner->candidate_image, symbol, result, error,
                                       error_size)) {
                return false;
            }
        } else {
            value = entry_field(runner, specification, "candidate_address");
            if (value == NULL) {
                value = entry_field(runner, specification, "reference_address");
            }
            if (value == NULL) {
                value = entry_field(runner, specification, "address");
            }
            if (!parse_number(value, &address) || address < 0 || address > UINT32_MAX) {
                snprintf(error, error_size, "candidate location has no address");
                return false;
            }
            *result = (uint32_t)address;
        }
        value = entry_field(runner, specification, "candidate_offset");
    } else {
        value = entry_field(runner, specification, "reference_address");
        if (value == NULL) {
            value = entry_field(runner, specification, "address");
        }
        if (!parse_number(value, &address) || address < 0 || address > UINT32_MAX) {
            snprintf(error, error_size, "reference location has no address");
            return false;
        }
        *result = (uint32_t)address;
        value = entry_field(runner, specification, "reference_offset");
    }
    if (value != NULL && !parse_number(value, &image_offset)) {
        snprintf(error, error_size, "location offset is invalid");
        return false;
    }
    value = entry_field(runner, specification, "offset");
    if (value != NULL && !parse_number(value, &common_offset)) {
        snprintf(error, error_size, "location offset is invalid");
        return false;
    }
    *result = (uint32_t)(*result + image_offset + common_offset);
    return true;
}

static bool add_part(StepParts* parts, const JsonValue* value, char* error,
                     size_t error_size) {
    if (value == NULL) {
        return true;
    }
    if (value->type != JSON_OBJECT || parts->count == MAX_STEP_PARTS) {
        snprintf(error, error_size, "step has too many or invalid overlays");
        return false;
    }
    parts->items[parts->count++] = value;
    return true;
}

static const JsonValue* scalar_field(const StepParts* parts, const char* name) {
    size_t index = parts->count;
    while (index != 0u) {
        const JsonValue* value = json_get(parts->items[--index], name);
        if (value != NULL) {
            return value;
        }
    }
    return NULL;
}

static size_t fixture_step_count(const Runner* runner, const char* name,
                                 unsigned depth) {
    const JsonValue* fixture;
    const JsonValue* nested;
    const JsonValue* steps;
    size_t count = 0u;
    size_t index;
    if (depth > 32u) {
        return 0u;
    }
    fixture = named_entry(suite_section(runner, "fixtures"), name);
    if (fixture == NULL) {
        return 0u;
    }
    if (fixture->type == JSON_ARRAY) {
        return fixture->as.array.count;
    }
    nested = json_get(fixture, "fixtures");
    if (nested != NULL && nested->type == JSON_ARRAY) {
        for (index = 0u; index < nested->as.array.count; index++) {
            const char* child = json_string(nested->as.array.items[index]);
            if (child != NULL) {
                count += fixture_step_count(runner, child, depth + 1u);
            }
        }
    }
    steps = json_get(fixture, "steps");
    if (steps != NULL && steps->type == JSON_ARRAY) {
        count += steps->as.array.count;
    }
    return count;
}

