tylertms/dspic33e-sim/src/firmware_runner.c
static bool compare_memory(Runner* runner, const StepParts* parts, size_t* failures,
                           char* error, size_t error_size) {
    size_t part_index;
    bool found = false;
    for (part_index = parts->count; part_index != 0u;) {
        const JsonValue* values = json_get(parts->items[--part_index], "memory");
        size_t index;
        if (values == NULL) {
            continue;
        }
        if (found && part_index < 2u) {
            continue;
        }
        found = true;
        if (values->type != JSON_ARRAY) {
            return false;
        }
        for (index = 0u; index < values->as.array.count; index++) {
            if (!compare_memory_item(runner, values->as.array.items[index], failures,
                                     error, error_size)) {
                return false;
            }
        }
    }
    {
        bool exact = false;
        const JsonValue* enabled = scalar_field(parts, "compare_exact_program_data");
        const JsonValue* values = suite_section(runner, "exact_program_data");
        json_boolean(enabled, &exact);
        if (exact && values != NULL && values->type == JSON_ARRAY) {
            size_t index;
            for (index = 0u; index < values->as.array.count; index++) {
                if (!compare_memory_item(runner, values->as.array.items[index],
                                         failures, error, error_size)) {
                    return false;
                }
            }
        }
    }
    return true;
}

static bool compare_pins(Runner* runner, const StepParts* parts, size_t* failures,
                         char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "pins");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const char* name = item->type == JSON_STRING
                               ? json_string(item)
                               : json_string(json_get(item, "name"));
        const char* expected =
            item->type == JSON_OBJECT ? json_string(json_get(item, "expected")) : NULL;
        uint8_t port;
        uint8_t bit;
        bool reference_high;
        bool candidate_high;
        bool matched;
        if (!pin_index(name, &port, &bit)) {
            snprintf(error, error_size, "invalid pin observation");
            return false;
        }
        reference_high = (runner->reference.io.gpio[port] & (1u << bit)) != 0u;
        candidate_high = (runner->candidate.io.gpio[port] & (1u << bit)) != 0u;
        matched = reference_high == candidate_high;
        if (expected != NULL) {
            bool expected_high = strcmp(expected, "3.3V") == 0;
            matched = matched && reference_high == expected_high;
        }
        runner->comparisons++;
        if (!matched) {
            (*failures)++;
            printf("  pin %s: reference=%s candidate=%s", name,
                   reference_high ? "3.3V" : "0V", candidate_high ? "3.3V" : "0V");
            if (expected != NULL) {
                printf(" expected=%s", expected);
            }
            printf("\n");
        }
    }
    return true;
}

static bool apply_generated_value(Runner* runner, const JsonValue* specification,
                                  int64_t value, bool range, char* error,
                                  size_t error_size) {
    const char* name = json_string(json_get(specification, "register"));
    const JsonValue* location = json_get(specification, "location");
    int64_t base = 0;
    int64_t shift = 0;
    int64_t offset = 0;
    uint16_t word;
    if (!range) {
        if ((json_get(specification, "base") != NULL &&
             !parse_number(json_get(specification, "base"), &base)) ||
            (json_get(specification, "shift") != NULL &&
             !parse_number(json_get(specification, "shift"), &shift))) {
            return false;
        }
    }
    if (shift < 0 || shift > 15) {
        return false;
    }
    word = (uint16_t)(base | (value << shift));
    if (location != NULL) {
        uint32_t reference_address;
        uint32_t candidate_address;
        if ((json_get(specification, "offset") != NULL &&
             !parse_number(json_get(specification, "offset"), &offset)) ||
            !mapped_address(runner, location, false, &reference_address, error,
                            error_size) ||
            !mapped_address(runner, location, true, &candidate_address, error,
                            error_size)) {
            return false;
        }
        dspic33_write_word(&runner->reference, (uint32_t)(reference_address + offset),
                           word);
        dspic33_write_word(&runner->candidate, (uint32_t)(candidate_address + offset),
                           word);
        return true;
    }
    {
        uint8_t reg;
        if (!register_index(name, &reg)) {
            snprintf(error, error_size, "generated value has no destination");
            return false;
        }
        runner->reference.w[reg] = word;
        runner->candidate.w[reg] = word;
    }
    return true;
}

static bool execute_step(Runner* runner, const char* scenario_name,
                         const char* generated_name, const StepParts* parts,
                         const JsonValue* scenario_call,
                         const JsonValue* range_specification, int64_t range_value,
                         const MatrixSelection* matrix_selections,
                         size_t matrix_selection_count, char* error,
                         size_t error_size) {
    const JsonValue* reset = scalar_field(parts, "reset_before");
    const JsonValue* call = scalar_field(parts, "call");
    const JsonValue* stop = scalar_field(parts, "stop");
    const char* step_name = generated_name;
    bool reset_value = false;
    size_t index;
    size_t failures = 0u;
    if (step_name == NULL) {
        step_name = json_string(scalar_field(parts, "name"));
    }
    if (step_name == NULL) {
        step_name = "unnamed step";
    }
    if (call == NULL) {
        call = scenario_call;
    }
    json_boolean(reset, &reset_value);
    if (reset_value) {
        reset_pair(runner);
    }
    runner->current_step++;
    if (!runner->failures_only) {
        printf("[running] %zu/%zu %s: %s\n", runner->current_step, runner->steps,
               scenario_name, step_name);
        fflush(stdout);
    }
    for (index = 0u; index < parts->count; index++) {
        if (!apply_stimuli_part(runner, parts->items[index], error, error_size)) {
            return false;
        }
    }
    if (range_specification != NULL &&
        !apply_generated_value(runner, range_specification, range_value, true, error,
                               error_size)) {
        return false;
    }
    for (index = 0u; index < matrix_selection_count; index++) {
        if (matrix_selections[index].generated &&
            !apply_generated_value(runner, matrix_selections[index].specification,
                                   matrix_selections[index].value, false, error,
                                   error_size)) {
            return false;
        }
    }
    if (!run_pair(runner, call, stop, error, error_size) ||
        !compare_registers(runner, parts, &failures, error, error_size) ||
        !compare_memory(runner, parts, &failures, error, error_size) ||
        !compare_pins(runner, parts, &failures, error, error_size)) {
        return false;
    }
    if (failures == 0u) {
        runner->passed++;
        if (!runner->failures_only) {
            printf("[passed] %zu/%zu %s\n", runner->current_step, runner->steps,
                   step_name);
        }
    } else {
        runner->failed++;
        printf("[failed] %zu/%zu %s (%zu differences)\n", runner->current_step,
               runner->steps, step_name, failures);
    }
    fflush(stdout);
    return true;
}

static bool value_at(const Runner* runner, const JsonValue* specification, size_t index,
                     int64_t* result) {
    const char* set_name = json_string(json_get(specification, "values"));
    const JsonValue* values;
    int64_t start;
    int64_t stride = 1;
    if (set_name != NULL) {
        values = named_entry(suite_section(runner, "value_sets"), set_name);
        return values != NULL && values->type == JSON_ARRAY &&
               index < values->as.array.count &&
               parse_number(values->as.array.items[index], result);
    }
    if (!parse_number(json_get(specification, "start"), &start)) {
        return false;
    }
    if (json_get(specification, "stride") != NULL &&
        !parse_number(json_get(specification, "stride"), &stride)) {
        return false;
    }
    *result = start + (int64_t)index * stride;
    return true;
}

static bool execute_fixture(Runner* runner, const char* fixture_name,
                            const char* scenario_name, unsigned depth, char* error,
                            size_t error_size) {
    const JsonValue* fixture;
    const JsonValue* nested;
    const JsonValue* steps;
    const JsonValue* suite_defaults =
        json_get(suite_section(runner, "testbench"), "defaults");
    size_t index;
    if (depth > 32u) {
        snprintf(error, error_size, "fixture recursion is too deep");
        return false;
    }
    fixture = named_entry(suite_section(runner, "fixtures"), fixture_name);
    if (fixture == NULL) {
        snprintf(error, error_size, "unknown fixture: %s", fixture_name);
        return false;
    }
    if (fixture->type == JSON_ARRAY) {
        steps = fixture;
        nested = NULL;
    } else {
        nested = json_get(fixture, "fixtures");
        steps = json_get(fixture, "steps");
    }
    if (nested != NULL && nested->type == JSON_ARRAY) {
        for (index = 0u; index < nested->as.array.count; index++) {
            const char* name = json_string(nested->as.array.items[index]);
            if (name == NULL || !execute_fixture(runner, name, scenario_name,
                                                 depth + 1u, error, error_size)) {
                return false;
            }
        }
    }
    if (steps == NULL || steps->type != JSON_ARRAY) {
        return true;
    }
    for (index = 0u; index < steps->as.array.count; index++) {
        StepParts parts = {0};
        if (!add_part(&parts, suite_defaults, error, error_size) ||
            !add_part(&parts, steps->as.array.items[index], error, error_size) ||
            !execute_step(runner, scenario_name, NULL, &parts, NULL, NULL, 0, NULL, 0u,
                          error, error_size)) {
            return false;
        }
    }
    return true;
}

