tylertms/dspic33e-sim/src/firmware_runner.c
static bool execute_scenario(const char* path, const JsonValue* scenario, void* context,
                             char* error, size_t error_size) {
    Runner* runner = context;
    const char* name = json_string(json_get(scenario, "name"));
    const JsonValue* fixtures;
    const JsonValue* mode;
    size_t index;
    (void)path;
    if (!scenario_selected(runner, scenario)) {
        return true;
    }
    if (scenario_step_count(runner, scenario) == 0u) {
        return true;
    }
    runner->current_scenario++;
    reset_pair(runner);
    printf("[scenario] %zu/%zu %s\n", runner->current_scenario, runner->scenarios,
           name);
    fflush(stdout);
    fixtures = json_get(scenario, "fixtures");
    if (fixtures != NULL && fixtures->type == JSON_ARRAY) {
        for (index = 0u; index < fixtures->as.array.count; index++) {
            const char* fixture_name = json_string(fixtures->as.array.items[index]);
            if (fixture_name == NULL ||
                !execute_fixture(runner, fixture_name, name, 0u, error, error_size)) {
                return false;
            }
        }
    }
    mode = json_get(scenario, "steps");
    if (mode == NULL) {
        mode = json_get(scenario, "vectors");
    }
    if (mode != NULL) {
        return execute_regular_steps(runner, scenario, mode, name, error, error_size);
    }
    mode = json_get(scenario, "range");
    if (mode != NULL) {
        return execute_range(runner, scenario, mode, name, error, error_size);
    }
    mode = json_get(scenario, "matrix");
    return mode != NULL &&
           execute_matrix(runner, scenario, mode, name, error, error_size);
}

static void print_usage(const char* program) {
    fprintf(stderr,
            "Usage: %s --suite FILE [--scenario PATTERN] [--step PATTERN] "
            "[--failures-only] [--max-instructions COUNT]\n",
            program);
}

int firmware_runner_main(int argc, char** argv) {
    Runner runner = {0};
    const char* suite_path = NULL;
    char error[256];
    int index;
    for (index = 1; index < argc; index++) {
        if (strcmp(argv[index], "--suite") == 0 && index + 1 < argc) {
            suite_path = argv[++index];
        } else if (strcmp(argv[index], "--scenario") == 0 && index + 1 < argc) {
            runner.scenario_filter = argv[++index];
        } else if (strcmp(argv[index], "--step") == 0 && index + 1 < argc) {
            runner.step_filter = argv[++index];
        } else if (strcmp(argv[index], "--failures-only") == 0) {
            runner.failures_only = true;
        } else if (strcmp(argv[index], "--max-instructions") == 0 && index + 1 < argc) {
            char* end;
            runner.instruction_limit = strtoull(argv[++index], &end, 0);
            if (*end != '\0' || runner.instruction_limit == 0u) {
                print_usage(argv[0]);
                return 2;
            }
        } else {
            print_usage(argv[0]);
            return 2;
        }
    }
    if (suite_path == NULL || !suite_directory(suite_path, runner.suite_directory,
                                               sizeof(runner.suite_directory))) {
        print_usage(argv[0]);
        return 2;
    }
    runner.suite_path = suite_path;
    printf("[prepare] Loading firmware test specification\n");
    fflush(stdout);
    runner.suite = json_read(suite_path, error, sizeof(error));
    if (runner.suite == NULL) {
        fprintf(stderr, "[error] %s\n", error);
        return 1;
    }
    printf("[prepare] Counting streamed scenarios\n");
    fflush(stdout);
    if (!stream_patterns(&runner, count_scenario, error, sizeof(error)) ||
        runner.scenarios == 0u) {
        if (runner.scenarios == 0u) {
            snprintf(error, sizeof(error),
                     "no scenarios matched the requested filters");
        }
        fprintf(stderr, "[error] %s\n", error);
        json_free((JsonValue*)runner.suite);
        return 1;
    }
    printf("[prepare] Loaded %zu scenarios with %zu ordered steps\n", runner.scenarios,
           runner.steps);
    fflush(stdout);
    if (!open_images(&runner, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        close_images(&runner);
        json_free((JsonValue*)runner.suite);
        return 1;
    }
    if (!start_run_tasks(&runner)) {
        fprintf(stderr, "[error] cannot start native simulator workers\n");
        close_images(&runner);
        json_free((JsonValue*)runner.suite);
        return 1;
    }
    printf("[ready] Starting native differential execution\n");
    fflush(stdout);
    if (!stream_patterns(&runner, execute_scenario, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        stop_run_tasks(&runner);
        close_images(&runner);
        json_free((JsonValue*)runner.suite);
        return 1;
    }
    printf("[summary] scenarios=%zu steps=%zu passed=%zu failed=%zu comparisons=%zu\n",
           runner.current_scenario, runner.current_step, runner.passed, runner.failed,
           runner.comparisons);
    printf("[work] reference-instructions=%" PRIu64 " candidate-instructions=%" PRIu64
           " reference-cycles=%" PRIu64 " candidate-cycles=%" PRIu64 "\n",
           runner.reference_instructions, runner.candidate_instructions,
           runner.reference_cycles, runner.candidate_cycles);
    stop_run_tasks(&runner);
    close_images(&runner);
    json_free((JsonValue*)runner.suite);
    return runner.failed == 0u ? 0 : 1;
}
